app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all #allメソッドでtasksテーブルの全ての情報を取得する
---
SELECT "tasks".* FROM "tasks"

  def create
      @task = Task.new(params.require(:task).permit(:name, :email, :age, :introduction))
      if @task.save
---
INSERT INTO "tasks" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-10-04 08:29:10.027148"], ["updated_at", "2021-10-04 08:29:10.027148"]]